/* No comment provided by engineer. */
"1 byte" = "1 tavu";

/* No comment provided by engineer. */
"16 bytes" = "16 tavua";

/* No comment provided by engineer. */
"2 bytes" = "2 tavua";

/* No comment provided by engineer. */
"32 bytes" = "32 tavua";

/* No comment provided by engineer. */
"4 bytes" = "4 tavua";

/* No comment provided by engineer. */
"8 bytes" = "8 tavua";

/* ASCII char set name in status bar */
"ASCII" = "ASCII";

/* String encodings message */
"At least one encoding has to be selected" = "Vähintään yksi koodaus tulee olla valittuna";

/* No comment provided by engineer. */
"Authentication cancelled. Download failed." = "Autentikointi peruttiin. Lataus epäonnistui.";

/* Selected block extend location
   Selected block shrink location */
"Back" = "Taakse";

/* Block move direction */
"Backward" = "Takaisin";

/* Big endianess, for toolbar combo box */
"Big" = "Eniten merkitsevä ensin";

/* No comment provided by engineer. */
"Big Endian" = "Eniten merkitsevä ensin";

/* No comment provided by engineer. */
"Can't make up destination file name. Download failed." = "Tiedostonimeä ei voitu tehdä. Lataus epäonnistui.";

/* Cancel button title */
"Cancel" = "Peru";

/* Clear recent searches in toolbar search field */
"Clear" = "Tyhjennä";

/* Toolbar button title */
"Copy" = "Kopioi";

/* No comment provided by engineer. */
"Copy Selection" = "Kopioi valinta";

/* Message when string can't be converted to a hex integer */
"Couldn't convert to hex integer." = "Ei voitu muuntaa heksadesimaaliseksi kokonaisluvuksi.";

/* Toolbar button title */
"Cut" = "Leikkaa";

/* No comment provided by engineer. */
"Cut Selection" = "Leikkaa valinta";

/* Title of the dialog warning the user they are about to put too much data on the clipboard (hundreds of megabytes */
"Data Too Large" = "Liikaa dataa";

/* Shorthand for decimal, for status bar */
"Dec" = "Desimaali";

/* Decimal numbers */
"Decimal" = "Desimaali";

/* No comment provided by engineer. */
"Download complete." = "Lataus suoritettu";

/* No comment provided by engineer. */
"Download failed:" = "Lataus epäonnistui";

/* No comment provided by engineer. */
"Download redirected to " = "Lataus uudelleenohjattu osoitteeseen ";

/* No comment provided by engineer. */
"Downloading" = "Ladataan";

/* EBCDIC char set name in status bar */
"EBCDIC" = "EBCDIC";

/* PLACEHOLDER */
"Empty" = "Tyhjä";

/* Toolbar combo title */
"Endianess" = "Tavujärjestys";

/* No comment provided by engineer. */
"Endianess Selection" = "Tavujärjestyksen valinta";

/* Button title for block extend */
"Extend" = "Laajenna";

/* Window title for block extend */
"Extend Selection" = "Laajenna valintaa";

/* Toolbar text field title */
"Find" = "Etsi";

/* No comment provided by engineer. */
"Find in File" = "Etsi tiedostosta";

/* Block move direction */
"Forward" = "Eteenpäin";

/* Selected block extend location
   Selected block shrink location */
"Front" = "Eteen";

/* General preferences title */
"General" = "Yleiset";

/* Toolbar text field title */
"Go To Offset" = "Siirry osoitteeseen";

/* No comment provided by engineer. */
"Go to Offset" = "Siirry osoitteeseen";

/* GSM char set name in status bar */
"GSM" = "GSM";

/* Hexadecimal numbers
   Search type
   Shorthand for hexadecimal, for status bar */
"Hex" = "Heksadesimaali";

/* No comment provided by engineer. */
"Hex search" = "Heksadesimaalihaku";

/* Title of a panel telling user that their plugin is incompatible with the current architecture they're running on */
"Incompatible Plug-in" = "Yhteensopimaton plug-in";

/* Write mode */
"Insert" = "Lisäävä kirjoitus";

/* No comment provided by engineer. */
"Invalid hex character in string" = "Epäkelpo heksadesimaalimerkki merkkijonossa";

/* items replaced in search and replace */
"item(s) replaced" = "kohdetta korvattu";

/* Title of the dialog warning the user they are about to put too much data on the clipboard (hundreds of megabytes */
"Large Data" = "Suuri määrä dataa";

/* Little endianess, for toolbar combo box */
"Little" = "Vähiten merkitsevä ensin";

/* No comment provided by engineer. */
"Little Endian" = "Vähiten merkitsevä ensin";

/* Message telling the user the maximum about of data they can put on the clipboard. %s will get replaced by the actual number of bytes (eg 5 MB, 10 GB, ...) */
"Maximum amount of data that can be put on the clipboard is %s" = "Maksimimäärä dataa leikepöydällä on %s";

/* String encodings message */
"Maximum number of selectable encodings reached" = "Enempää koodauksia ei voida valita";

/* Button title for moving selected block */
"Move" = "Siirrä";

/* Window title for moving selected blocks */
"Move Selection" = "Siirrä valintaa";

/* Window title when new version of 0xED is found */
"New Version Available" = "Uusi versio saatavilla";

/* No comment provided by engineer. */
"New version of this application is available. Would you like to download it?" = "Uusi versio ohjelmasta on saatavilla. Haluatko ladata sen?";

/* No comment provided by engineer. */
"No" = "Ei";

/* No lines in binary display */
"No lines" = "Ei viivoja";

/* File offset for status bar */
"Offset" = "Osoite";

/* OK button title */
"OK" = "OK";

/* Window title when directory is dropped on 0xED */
"Open Directory" = "Avaa kansio";

/* Write mode */
"Overwrite" = "Päällekirjoitus";

/* No comment provided by engineer. */
"Parts of the file were unreadable. Those will be displayed blank in the output. Further editing of this file is disabled." = "Joitain tiedoston osia ei voitu lukea, joten ne näytetään tyhjinä. Tiedoston muokkaaminen estetään.";

/* Toolbar button title */
"Paste" = "Sijoita";

/* No comment provided by engineer. */
"Paste from Clipboard" = "Sijoita leikepöydältä";

/* Message offering solution for incompatible plugin. %s will be replaced by the plugin path. */
"Plug-in (%s) is incompatible with the app architecture. It will need to be recompiled." = "Plug-in (%s) ei ole yhteensopiva ohjelman arkkitehtuurin kanssa ja se täytyy koota uudelleen.";

/* File read error panel title */
"Read Error" = "Lukuvirhe";

/* Menu title for search field in toolbar */
"Recent Searches" = "Äskeiset haut";

/* Toolbar button title */
"Redo" = "Tee sittenkin";

/* No comment provided by engineer. */
"Redo Action" = "Tee sittenkin";

/* No comment provided by engineer. */
"Required authentication failed. Download unsuccessful." = "Autentikointi epäonnistui. Lataus epäonnistui.";

/* This will be put in the title of the window if resource fork is opened */
"Resource Fork" = "Resurssihaarukka";

/* Toolbar button title */
"Save" = "Tallenna";

/* No comment provided by engineer. */
"Save File" = "Tallenna tiedosto";

/* Selection length for status bar */
"Selection" = "Valinta";

/* Button title for block shrink */
"Shrink" = "Kutista";

/* Window title for block shrink */
"Shrink Selection" = "Kutista valintaa";

/* Toolbar combo title */
"String Encoding" = "Tekstin koodaus";

/* No comment provided by engineer. */
"String Encoding Selection" = "Tekstin koodaus";

/* Search type */
"Text" = "Teksti";

/* Toolbar combo title that will show text modes (ASCII, EBCDIC, GSM, ...) */
"Text Column" = "Tekstiosio";

/* No comment provided by engineer. */
"Text Column (ASCII, EBCDIC, GSM, ...)" = "Tekstiosio (ASCII, EBCDIC, GSM, ...)";

/* No comment provided by engineer. */
"Text search" = "Tekstihaku";

/* No comment provided by engineer. */
"The other fork could not be opened" = "Toista haarukkaa ei voitu avata";

/* Confirmation when a directory with a large number of files is dropped on 0xED. %u will be replaced by the number of files */
"There are %u files in the directory. Are you sure you want to proceed?" = "Kansiossa on %u tiedostoa. Haluatko jatkaa?";

/* Visualizer column header name */
"Type" = "Tyyppi";

/* User interface preferences title */
"UI" = "Käyttöliittymä";

/* No comment provided by engineer. */
"Unable to open other fork" = "Toista haarukkaa ei voitu avata";

/* Toolbar button title */
"Undo" = "Peru";

/* No comment provided by engineer. */
"Undo Action" = "Peru toiminto";

/* Visualizer column header name */
"Value" = "Arvo";

/* Visualizer preferences title */
"Visualizer" = "Visualisoija";

/* No comment provided by engineer. */
"Yes" = "Kyllä";

/* Message telling the user they're about to put a large amount of data on the clipboard. %s will get replaced by the actual number of bytes (eg 5 MB, 10 GB, ...) */
"You are trying to put %s of data on the clipboard. Are you sure you want to proceed?" = "Olet siirtämässä leikepöydälle %s dataa. Oletko varma?";